t, r = input(), input()
tim = ['каменьножницы', 'ножницыбумага', 'бумагакамень', 'каменьящерица',
      'ящерицаСпок', 'Спокножницы', 'ножницыящерица', 'ящерицабумага', 'Споккамень']
if t == r:
    print("ничья")
else:
    if t+r in tim:
        print("Тимур")
    else:
        print("Руслан")

# 2

m = {"камень": ["ножницы", "ящерица"],
    "ножницы": ["бумага", "ящерица"],
    "бумага": ["камень", "Спок"],
    "ящерица": ["Спок", "бумага"],
    "Спок": ["камень", "ножницы"]}
t, r = input(), input()
if r == t:
    print("ничья")
elif r in m[t]:
    print("Тимур")
else:
    print("Руслан")

# 3

# magic_dict = {'ножницы': ('бумага', 'ящерица'),
#               'бумага': ('камень', 'Спок'),
#               'камень': ('ножницы', 'ящерица'),
#               'ящерица': ('Спок', 'бумага'),
#               'Спок': ('ножницы', 'камень')}
# if t == r:
#     print("ничья")
# else:
#     for key, value in magic_dict.items():
#         if t in key and r in value:
#             print("Тимур")
#     else:
#         print("Руслан")
